results/mpi_benchmark/sysbench_fio/fio_cephfs/oc_sys-fio_cephfs.worker01_1threads.2/stdout
sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     539.51
    fsyncs/s:                     703.17

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               8.43

General statistics:
    total time:                          10.0078s
    total number of events:              12310

Latency (ms):
         min:                                    0.00
         avg:                                    0.81
         max:                                    5.70
         95th percentile:                        2.91
         sum:                                 9991.20

Threads fairness:
    events (avg/stddev):           12310.0000/0.00
    execution time (avg/stddev):   9.9912/0.00

sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      1300.97
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  20.33
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0006s
    total number of events:              13012

Latency (ms):
         min:                                    0.00
         avg:                                    0.77
         max:                                   10.81
         95th percentile:                        1.16
         sum:                                 9981.89

Threads fairness:
    events (avg/stddev):           13012.0000/0.00
    execution time (avg/stddev):   9.9819/0.00

DONE